/*{{{+++++++++++++++++++++++ <Description> ++++++++++++++++++++++++++
 * 发信人: liyangzmx (liyangzmx), 信区: CProgramming
 * 标  题: 发个有趣的
 * 发信站: 水木社区 (Wed Aug  1 19:59:06 2012), 站内
 *
 * 我知道，大家看了这个图，又笑了~闲的蛋疼的时候写的，
 * 觉得弱智的，勿喷，觉得简单，你大可以把类似的代码贴上来，大家一起学习
 * -------------------------------------------------------------}}}*/
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

int main(int argc, char* argv[]) {
    int ok = 0, p = 0, q = 0;
    char pro[] = {'-','\\','|','/'}, all[51], *cur;  // 指针定义；

    for(ok = 0; ok <= 100; ++ok) {
        // 这里除以2，否则进度条太长；
        if (0 == ok % 2) {    
            /* print bar; */
            cur = all;
            sprintf(cur, "Processing...");  // 准备要打印的字符缓冲；
            cur += 13;
            for(p = 0; p < 10; p++) {
                sprintf(cur, " ");
                cur++;
            }
            sprintf(cur, "%3d%%", ok);  // 这里打印进度；
            cur += 4;
            for(p = 0; p < 23; p++) {
                sprintf(cur, " ");
                cur++;
            }
            // 缓冲区已经写完了，开始printf输出
            // 先选绿色，然后反显，打完清除格式; 绿色打完进度条其它部分，绿色
            for (p=0; p < (ok/2); ++p)
                printf("\033[7m\033[32m%c\033[0m", all[p]); 
            for (p=0; p < (50-(ok/2)); ++p)
                printf("\033[32m%c", all[ok/2+p]);
            ++q;

            //这里最好不要换行，打印旋转的进度棒棒，有换行，一会儿会处理；
            printf("\033[7m\033[32m \033[0m\033[1000C\033[3D\033[34m[\033[31m%c\033[34m]\033[0m\n", pro[q-1]);  
            usleep(100000);  //故意的延时，防止进度条走的太快；
            if (4 == q)
                q = 0;
            //移动到上一行头部，然后清除该行；实验发现换行好像是必须的， 如果不换行会有闪烁；
            printf("\033[1A\033[100D\033[K");
        }
    }
    return 0;
}
